{
  "applications": [
    {
      "id": "1",
      "dateReceived": "2025-11-01",
      "company": "Constructor",
      "role": "Full Stack Engineer",
      "jobDescription": "We're looking for a passionate and skilled full-stack engineer to join our Searchandizing team. You'll be responsible for creating and maintaining the tools used by merchandisers of global e-commerce brands to manage their product discovery experience. Your focus will be on delivering features for our Searchandizing dashboard, improving system stability, and scaling our solutions to better serve merchandisers.\n\nOur ultimate goal is to enhance the product discovery experience for shoppers worldwide and improve the onboarding process for new merchandisers, making it faster and easier for them to get up and running on the Constructor platform.\n\nRequirements:\n- Hands on experience with Python\n- Have strong hands on experience with backend development\n- Have hands on experience with devops tools like (AWS-ECS, Cloud Watch, etc.)\n- Have experience launching and operating backend systems\n- Hands on experience with Flask or similar web frameworks for building APIs\n- Experience owning and deploying full stack services\n- Experience with automated testing practices\n- Familiarity with CI/CD best practices\n- Hands on experience with react is a plus\n- Familiarity with frontend best coding practices\n- Excellent communication and collaboration skills\n- A proactive and results-oriented mindset\n- Experience working in remote environments will be a plus"
    },
    {
      "id": "2",
      "dateReceived": "2025-11-02",
      "company": "LangChain",
      "role": "Full Stack Engineer (LangSmith)",
      "jobDescription": "We're looking for a Full Stack Engineer to work on LangSmith, our commercial observability and evals platform product. In this role, you'll have the opportunity to build new features and functionality for the platform while working close enterprise customers, developer end-users and internal stakeholders.\n\nIn person 5 days/week in San Francisco\n\nResponsibilities:\n- Develop and implement key product features working across our entire Go, Python, and Typescript stack\n- Collaborate closely with product and design teams to iterate on new features and enhance the product roadmap\n- Drive aggressive project timelines while ensuring high engineering standards are being met by writing clean, maintainable, and well-tested code\n\nHow to be successful in this role:\n- 2+ years of experience in software engineering working on complex platform products\n- Fullstack engineering experience with Go or Python on the backend and React + Typescript on the frontend\n- Solid understanding of database systems, particularly Postgres and Redis\n- Experience designing and scaling APIs, preferably in high-performance, data-intensive applications\n- A 'get stuff done' attitude - comfortable shipping fast and iterating based on user feedback\n- Strong communicator with the ability to collaborate closely with various internal stakeholders and engage directly with our top-tier customers\n- Strong ownership mindset\n- Bonus: Experience with AI/LLM-powered applications, developer tools, or observability platforms\n\nAnnual salary range: $140,000-175,000 USD"
    },
    {
      "id": "3",
      "dateReceived": "2025-11-03",
      "company": "Develop Health",
      "role": "AI Engineer",
      "jobDescription": "We're hiring an AI Engineer to take models from prototype to production and drive real clinical impact through applied AI. You'll have significant autonomy to define high-value projects, build production-ready systems, and ensure our models are safe, reliable, and deeply useful in the healthcare workflow.\n\nYou'll work closely with our product engineers, clinical leaders, and CTO to ensure that our AI delivers measurable improvements in patient access and operational efficiency. This is a hands-on role that combines cutting-edge AI development with pragmatic engineering and evaluation.\n\nWhat You'll Do - Impact In Your First 3-6 Months:\n- Build and curate datasets and context sources to enable exceptional prompt engineering and evaluation of frontier LLMs, optimizing inputs, retrieval, and context to deliver cutting-edge performance and reliability\n- Design and maintain evaluation pipelines that rigorously measure model accuracy, reliability, and real-world clinical value\n- Prompt, test, and iterate on LLM workflows—including retrieval, agent logic, and tool use—to achieve industry-leading performance\n- Deploy models into production: design APIs, integrate inference into our Python-based backend, and implement observability and monitoring\n- Stay on the frontier of AI research, evaluating and incorporating advancements that enhance our platform\n\nWhat You'll Bring On Day 1:\n- 3+ years of experience in applied AI or machine learning engineering\n- Deep, hands-on experience with LLMs, modern AI frameworks, and evaluation techniques\n- Strong proficiency in Python, including API design and integration of AI models into production systems\n- Demonstrated ability to independently identify impactful projects and deliver them end-to-end\n- A mindset oriented toward ownership, autonomy, and measurable outcomes, not ticket-driven work\n- Comfort operating in a fast-paced, high-autonomy startup environment\n- Availability to work on-site in Menlo Park at least three days per week"
    },
    {
      "id": "4",
      "dateReceived": "2025-11-04",
      "company": "Everbright Health",
      "role": "Senior Software Engineer",
      "jobDescription": "We're hiring a Senior Software Engineer to help shape the future of tech-enabled mental healthcare. This role is ideal for someone who thrives in ambiguity, has experience building 0-to-1 systems, and is excited to be a technical thought partner from day one. You'll work closely with our Head of Product and cross-functional leaders to architect and build the systems that power our clinical programs—from AI-enabled patient eligibility tools to scalable workflows for treatment delivery.\n\nYou'll be hands-on with the code, while also helping shape Everbright's long-term technical direction.\n\nResponsibilities:\n- Build: Architect and develop full-stack systems that are scalable, reliable, and secure\n- Partner: Collaborate with product, clinical, and operational teams to deliver user-centered solutions\n- Scale: Support rapid growth with thoughtful trade-offs around tech debt and system complexity\n- Own: Serve as the technical backbone of the team, with high autonomy and ownership\n- Improve: Identify and drive opportunities to increase product velocity, code quality, and engineering efficiency\n- Explore: Apply emerging technologies—including AI/automation—to streamline complex workflows\n\nQualifications:\n- 4–6+ years of experience in software engineering (full stack preferred)\n- Fluency in Python, TypeScript, React, SQL, AWS, PostgreSQL\n- Experience building robust, high-throughput systems\n- Experience with 0-to-1 product builds and/or early-stage startups\n- Familiarity with cloud infrastructure and distributed systems architecture\n- Strong communication and collaboration skills across disciplines\n- Track record of balancing quality with speed in fast-paced environments\n- Growth mindset and comfort with ambiguity\n- Passion for outcomes, not just output\n\nPay Range: Base compensation of $150,000 to $190,000. Includes competitive bonus, equity, and benefits package."
    },
    {
      "id": "5",
      "dateReceived": "2025-11-05",
      "company": "Aurora",
      "role": "Founding Applied AI/ML Engineer",
      "jobDescription": "Our core team of 15 is searching for an exceptional applied AI engineer to join as one of Aurora's founding technical hires. You'll work directly with our Co-Founders and product leadership to define and build Aurora's next-generation agentic platform - intelligent systems that anticipate, curate, and execute on the needs of the world's highest-performing individuals.\n\nThis is a chance to work with one of the world's richest proprietary behavioral datasets and build a revolutionary consumer AI product. This role reports directly to Aurora's Co-Founder & CTO, with the opportunity to rapidly grow into a leadership position across Engineering and Product.\n\nLocation: New York, USA (USA Work Authorization Required)\nSalary: $275,000 OTE ($225,000 Base + $50k Uncapped Performance-Base Bonus)\nStock: Founding Stock Options package at our ground-floor valuation with >100x upside potential and room for growth\n\nKey Responsibilities:\n- Design and ship applied AI systems that personalize recommendations, automate complex workflows, and power Aurora's conversational experiences\n- Develop LLM-driven agents that integrate with our backend and internal tools to support real-world use cases in travel, dining, luxury, and wellness\n- Prototype, evaluate, and produce features involving retrieval-augmented generation (RAG), semantic search, and multi-agent orchestration\n- Collaborate closely with Product and Operations to deeply understand member and curator behavior, transforming that insight into intuitive AI experiences that feel 'magical'\n- Continuously refine prompt architectures, memory systems, and tool-use strategies for reliability, accuracy, and contextual depth\n- Lead technical experimentation around proactive recommendation systems, recommendation engines, personalization models, and reasoning loops\n- Contribute to backend architecture and data pipelines, ensuring scalable and reliable delivery of AI features\n\nTechnical Requirements:\n- 3+ years of applied ML engineering experience (Python preferred)\n- Proficient in web services and comfortable building production-grade APIs and services\n- Hands-on experience building with LLM frameworks and tools\n- Proven ability to design and deploy LLM pipelines, including retrieval-augmented generation (RAG) and tool-use orchestration\n- Familiarity with vector databases (Elasticsearch, PGVector, Pinecone) and embedding management\n- Experienced with modern ML model management and experimentation platforms (Hugging Face, Model Garden, MLflow, Weights & Biases)\n- Strong understanding of data pipelines, preprocessing, and prompt-level evaluation frameworks\n- Comfortable integrating external APIs and data sources into AI workflows\n- Comfortable with Google Cloud Platform (GKE, GCR, GCS, Cloud SQL, Vertex AI)\n- Familiar with containerized deployments (Docker, Kubernetes) and CI/CD workflows"
    },
    {
      "id": "6",
      "dateReceived": "2025-11-06",
      "company": "Junior",
      "role": "Backend Engineer",
      "jobDescription": "As a Backend Engineer, you'll help build and scale the systems that power our AI-driven research platform. This is a systems-level role - ideal for engineers who love thinking about data flows, orchestration, and performance across complex distributed systems.\n\nAs one of our first engineering hires, you'll have the unique opportunity to:\n- Ship quickly\n- Architect and scale backend systems that support high-throughput LLM interactions, vector search, and multi-agent orchestration\n- Stitch together AI infrastructure across model providers, data stores, and internal APIs to create cohesive, performant systems\n- Own reliability and observability, helping us evolve our database (Postgres / ClickHouse) and job orchestration systems\n- Prototype new backend capabilities (retrieval pipelines, caching layers, async task queues) that let us build faster and smarter\n- Shape our engineering culture\n\nAbout You:\n- Based in NYC, ***we are 5 days a week in person\n- Are excited by the intersection of AI infrastructure and systems design\n- Have experience leading projects end-to-end\n- Are eager to contribute to product decisions\n- Are proficient in our tech stack: Next.js, TypeScript, PostgreSQL\n- Feel like you are never building fast enough\n\nBonus points for experience working on:\n- Retrieval/embeddings/prompt orchestration\n- Built internal infrastructure / dev tools @ startups\n\nBenefits:\nAll the usual benefits (competitive pay and equity, private healthcare etc). Unusual benefits:\n- Gym membership\n- In-office cook\n- Summers working in Greece by the beach\n\nNote: No sponsorship available"
    },
    {
      "id": "7",
      "dateReceived": "2025-11-07",
      "company": "Ambient AI",
      "role": "Software Engineer",
      "jobDescription": "Position 1: Product Backend Engineer\n\nAs a Product Backend Engineer, you will design, develop, and optimize backend systems that directly impact user-facing web applications. You will collaborate closely with front-end engineers, product managers, and designers to ensure seamless integration and a stellar user experience.\n\nKey Responsibilities:\n- Design, build, and maintain backend APIs, services, and systems to support user-facing features\n- Collaborate with cross-functional teams to gather requirements and translate them into technical specifications\n- Ensure backend systems are scalable, secure, and performant under high-traffic conditions\n- Debug, diagnose, and resolve technical issues across the backend stack\n- Write clean, maintainable, and well-documented code, adhering to best practices\n- Implement robust monitoring, logging, and alerting solutions to ensure high system reliability\n- Contribute to architectural discussions and decisions to drive product innovation\n- Participate in code reviews, providing constructive feedback to peers and fostering a culture of excellence\n\nThe amazing skills you'll bring:\n- 3+ years of experience as a backend engineer working on user-facing web products\n- Proficiency in Python and frameworks like Flask, Django, or FastAPI\n- Experience with RESTful APIs, GraphQL APIs, gRPC, and working with real-time communication technologies\n- Strong understanding of databases (SQL and NoSQL) and efficient data modeling\n- Familiarity with cloud platforms (e.g., AWS, GCP, Azure)\n- Ability to troubleshoot, debug, and optimize backend performance\n- Exposure to front-end technologies (e.g., React, Angular, or Vue.js) to understand end-to-end workflows\n\n---\n\nPosition 2: Software Engineer (Distributed Systems)\n\nReporting into Raghu Nallamothu, in this role, you will play a crucial role in designing, building, scaling, and operating large-scale distributed systems. Your strong analytical and debugging skills will be essential in ensuring the robustness and reliability of our systems.\n\nKey Responsibilities:\n- Design, build, scale, and operate large-scale distributed systems\n- Utilize strong analytical and debugging skills to troubleshoot and resolve complex system issues\n- Demonstrate a strong bias towards action and a commitment to delivering high-quality results\n- Adapt quickly to changing environments and new technologies\n- Work proficiently with Unix-based systems\n- Leverage expertise in one or more programming languages, such as Python, Go, or C++, to develop and maintain software solutions\n- Collaborate with cross-functional teams to define, design, and deliver new features and enhancements\n- Ensure the performance, reliability, and scalability of the systems you build and maintain\n\nThe amazing skills you'll bring:\n- MS/PhD in Computer Science with a strong programming background\n- Strong analytical and debugging skills, with ability to troubleshoot complex issues\n- Ability to take initiative and deliver results in a fast-paced, dynamic environment\n- Proficiency in working with Unix-based systems\n- Expertise in one or more programming languages such as Python, Go, or C++\n- Excellent problem-solving skills and a strong attention to detail\n- Strong communication skills, with the ability to work effectively in a team environment\n- A passion for continuous learning and staying up-to-date with the latest industry trends and technologies"
    },
    {
      "id": "8",
      "dateReceived": "2025-11-08",
      "company": "Novig",
      "role": "Full Stack Engineer",
      "jobDescription": "You will work across the full stack to build the next generation of sports betting infrastructure. Drawing on technologies used in modern financial exchanges, you'll help enforce transparent, efficient market practices while delivering a seamless user experience. Your work may span everything from real-time backend systems and trading APIs to the frontend components that power our core product. You'll play a key role in shaping both the market engine and the interface through which users engage with it.\n\nResponsibilities:\n- Build and maintain a developer-first API experience for algorithmic trading and power users\n- Expand product features by extending modular backend services and contributing to frontend components\n- Scale up our real-time data ingestion, processing, and distribution pipelines\n- Collaborate closely with design and product teams to build performant, intuitive user interfaces\n- Contribute to architecture and system design decisions across the stack\n- Improve observability and reliability across backend and frontend systems\n\nRequirements:\n- Bachelor's or Master's degree in Computer Science or a related technical field\n- 3+ years of professional experience building full stack applications\n- Proficiency in a system programming language (e.g., Rust, Go, C++) and at least one modern frontend framework (e.g., React, Vue)\n- Experience developing distributed systems with cloud-based architecture\n- Strong product intuition and ability to translate business needs into technical solutions\n- Excellent communication and problem-solving skills\n- Comfortable working independently and within fast-moving, cross-functional teams\n\nCompensation: $170k – $210k + meaningful equity\n\nBenefits:\n- Robust health, dental, and vision plans, covering 100% of health premiums and 90% of dental and vision premiums\n- Generous 401(k) plan, matching up to 4% of base salary\n- Health Savings Account (HSA) with $1,080 annual company contributions\n- $27/day food or commuter stipend when working in our new office"
    },
    {
      "id": "9",
      "dateReceived": "2025-11-09",
      "company": "GoFundMe",
      "role": "Senior Agentic AI Developer",
      "jobDescription": "We're seeking a Senior Agentic AI Developer to build production-grade autonomous agents and orchestration systems that reshape the future of fundraising, campaign optimization, and donor engagement. We're looking for a senior technical member who can build LLM-based autonomous agents and multi agent orchestration systems with advanced reasoning, multi-step planning, and real-time orchestration capabilities.\n\nThis role is foundational. You'll design, deploy, and scale intelligent AI agents that reason, plan, and act in dynamic fundraising ecosystems. You'll enable multi-agent collaboration, long-term memory, and cross-agent communication in production environments serving millions of users.\n\nLocation: San Francisco, Bay Area (3x a week in-office requirement)\n\nThe Job:\n- Agent Architecture & Planning: Design and implement LLM-based autonomous agents that perform beyond simple responses — including planning, reasoning, tool-use, and long-term task decomposition. Engineer context- and memory-rich agents that integrate structured data, external APIs, and conversational context to optimize outcomes\n- Multi-Agent Orchestration: Build production-scale orchestration frameworks using tools such as LangGraph, Pydantic AI, Google ADK, and CrewAI to orchestrate complex workflows across campaign creation, optimization, and tracking in distributed microservices architectures. Implement agent-to-agent (A2A) communication protocols using Model Context Protocol (MCP)\n- Infrastructure & Deployment: Develop microservice-based, cloud-native infrastructure for autonomous agent deployment with Docker/Kubernetes, observability tooling, and cloud platforms (AWS/GCP)\n- Agent Memory & Tooling Systems: Architect and optimize vector and graph database integrations (e.g., Pinecone, Weaviate, ChromaDB) for agent memory and semantic recall. Build custom agentic frameworks for use cases across campaign storytelling, optimization, and donor engagement\n- Evaluation & Governance: Build and scale LLM evaluation pipelines, including human-in-the-loop and automated frameworks. Embed safety, fairness, transparency, and explainability into agent behavior\n\nYou:\n- 6+ years in software engineering, with 3+ years hands-on building production-grade AI/ML systems\n- Deep expertise in LLM agent frameworks (LangGraph, Google ADK, CrewAI, AutoGen, Pydantic AI, LangChain)\n- Proven ability to architect agentic systems from scratch, including planning/reasoning flows and multi-agent orchestration\n- Strong Python/TypeScript skills and experience in microservices and distributed infrastructure\n- Familiarity with vector databases (e.g., Pinecone, ChromaDB), knowledge graphs (Neo4j, Graphiti), and RAG pipelines\n- Deep autonomous agent architecture knowledge including advanced reasoning, planning, task decomposition, multi-step automation, tool-use patterns, evaluation systems beyond simple response generation\n- Enterprise integration expertise with RESTful APIs, A2A interoperability, webhook systems, Model Context Protocol (MCP) tools for dynamic tool discovery\n- Production experience with cloud-native infrastructure (Docker, Kubernetes, AWS/GCP)\n- Demonstrated experience with reinforcement learning, agent optimization, and agent evaluation techniques\n- Strong understanding of agent safety, bias mitigation, transparency, and ethical design practices\n\nThe total annual salary for this full-time position is $156,000 - $234,000 + equity + benefits"
    },
    {
      "id": "10",
      "dateReceived": "2025-11-10",
      "company": "CaseGuard",
      "role": "Software Engineer – Backend",
      "jobDescription": "We are seeking a highly independent and proactive Software Engineer to join our backend team and play a critical role in building REST API microservices from scratch using ASP.NET Core (C#) and building cloud infrastructure using Infrastructure as Code (IaC) in AWS. In this role, you will contribute to collaborative file redacting tool with exciting features like live editing, image processing and more.\n\nLocation: Arlington, VA\n\nWhat you will do:\n- Design and build scalable REST APIs for our microservices using ASP.NET Core (C#)\n- Implement efficient and secure API endpoints with a focus on performance and maintainability\n- Design and deploy AWS-based infrastructure using IaC tools (e.g., AWS CDK)\n- Participate in architectural discussions and contribute to decisions for system design and service structure\n- Optimize APIs for performance and scalability by identifying and resolving bottlenecks\n- Collaborate with cross-functional teams to align on feature requirements and implementation plans\n- Write clean, well-documented, and maintainable code while following best practices\n\nQualifications (Required):\n- Bachelor's degree in Computer Science, Software Engineering, or equivalent experience\n- 2+ years of experience as a backend software engineer, focusing on REST API development\n- Strong proficiency in C# and ASP.NET Core framework\n- Experience designing and implementing REST APIs\n- Familiarity with relational and NoSQL databases (e.g., SQL Server, MongoDB)\n- Experience with Git for version control and collaborative development\n- Ability to work independently and take ownership of complex backend tasks\n\nQualifications (It's a plus):\n- Strong understanding of distributed systems, scalability, and fault-tolerance patterns\n- Familiarity with API design patterns such as Clean Architecture\n- Hands-on experience with AWS services (e.g., EC2, S3, Lambda, RDS, DynamoDB)\n- Practical knowledge of IaC tools (e.g., AWS CDK, Terraform, CloudFormation)\n- Experience with containerization tools (e.g., Docker) and orchestration platforms (e.g., Kubernetes)\n- Familiarity with event-driven architectures and message queues (e.g., SNS, SQS, EventBridge)\n- Knowledge of asynchronous programming and multi-threading in C#\n- Relevant AWS certifications (e.g., AWS Certified Solutions Architect, AWS Certified Developer)\n\nBenefits:\n- Competitive Salary\n- Stock Option\n- Medical, Dental, and Vision Insurance\n- Paid Vacation\n- Ten paid holidays per year\n- Friendly and Learning environment"
    }
  ]
}
